自然 言語 （ しぜん げん ご 、 英 ： 　 ｎａｔｕｒａｌ 　 ｌａｎｇｕａｇｅ ） と は 、 人間 に よっ て 日常 の 意思 疎通 の ため に 用い られる 、 文化 的 背景 を 持っ て 自然 に 発展 し て き た 言語 で ある 。
分類 と し て 、 音声 言語 と 文字 言語 、 口頭 言語 と 書記 言語 、 口語 と 文語 と いっ た よう な 分類 が ある が 、 いずれ も 似 て いる よう だ が 着目 点 や 対比 軸 が 異なる 分類 で あり 、 混同 し て は なら ない 。
また 、 以上 の よう な 分類 が いずれ も 当たら ない 言語 も あり 、 例えば 日本 手話 （ 「 日本 語 対応 手話 」 と は 異なる ） が そう で ある 。
人間 が お 互い に コミュニケーション を 行う ため の 自然 発生 的 な 言語 で ある 。
「 自然 言語 」 に 対置 さ れる 語 に 「 形式 言語 」 「 人工 言語 」 が ある 。
形式 言語 と の 対比 で は 、 その 構文 や 意味 が 明確 に 揺るぎなく 定め られ 、 利用 者 に 厳格 な 規則 の 遵守 を 強いる （ こと が 多い ） 形式 言語 に 対し 、 話者 集団 の 社会 的 文脈 に 沿っ た 曖昧 な 規則 が 存在 し て いる と 考え られる もの が 自然 言語 で ある 。
自然 言語 に は 、 規則 が 曖昧 で ある が ゆえ に 、 話者 に よる 規則 の 解釈 の 自由 度 が 残さ れ て おり 、 話者 が 直面 し た 状況 に 応じ て 規則 の 解釈 を 変化 さ せる こと で 、 状況 を 共有 する 他 の 話者 と の コミュニケーション を 継続 する 事 が 可能 と なっ て いる 。
人間 の コミュニケーション を 目的 と し て 設計 さ れ た 形式 言語 、 と いっ た よう な もの も 存在 する が （ ログラン など ） あまり 多く ない 。
人工 言語 と いう 分類 は 少々 多義 的 で あり 、 形式 言語 の こと を 指し て いる 場合 も あれ ば 、 エスペラント など 「 人為 発生 的 な 自然 言語 」 と いっ た ほう が 良い 場合 も ある 。
自然 言語 の 発展 過程 は 自然 発生 的 で ある が 、 その 言語 それ 自体 は 言う まで も なく 「 ヒト に よる モノ 」 と いう 意味 で は 人工 物 で ある 。
なお 、 「 自然 言語 は 形式 言語 ・ 人工 言語 と 比較 し て 、 遥か に 多様 性 に 富ん で いる 」 など と 主張 する 者 が いる が 、 例えば 現代 に おけ る 代表 的 な 人工 言語 かつ 形式 言語 の ひと つ で ある コンピュータ ・ プログラミング 言語 の 多様 性 を きちんと 調査 比較 し た よう な 定量 的 な 根拠 は 無い 主張 だろう 。
また 、 文法 ， 単語 の 用法 に 曖昧 さ を 含み 、 使用 する 単語 ， 単語 の 順序 を 入れ替える 等 が 可能 で あり 、 感情 で 文章 を 制御 し やすい ため 、 多様 な 情景 表現 が 可能 と なっ て いる （ しかし 、 文法 、 単語 の 用法 に 曖昧 さ が 無く 、 使用 する 単語 、 単語 の 順序 を 入れ替える 等 が 不 可能 で 、 感情 で は なく 論理 で 文章 を 制御 し やすく て も 、 多様 な 情景 表現 は 可能 で ある ） 。
しかし 、 文法 、 単語 の 用法 が 曖昧 で ある ため 、 「 言語 仕様 」 の よう に 明確 に 固定 する こと は 難しい 。
各 自然 言語 自体 も 他 言語 と の 統合 が 起きる 事 に より 変化 し 続け て おり 、 自然 言語 の 文法 その 他 あらゆる 面 が 言語 学 に よっ て 研究 が 続け られ て いる 。
また 、 統計 的 手法 を 利用 する 計量 言語 学 や 、 情報 処理 の 対象 と し て 自然 言語 を 扱う 自然 言語 処理 は 、 コンピュータ の 能力 の 向上 に あわせ 、 また コンピュータ の より 便利 な 利用 の ため に （ 例えば ワード プロセッサ や 、 音声 入力 に よる 情報 探索 など ） 、 さかん に 研究 さ れ 実地 に も 応用 さ れる よう に なっ た 。
